Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Secretary Out-of-Order.tmx
Source language: en
Languages: es_419

source: I hope it's just us.
es_419: Ojalá no haya nadie más.

source: what I want to achieve with money...
es_419: ¿Qué quiero lograr con mi dinero?…

source: ...I did my best to make it seem like I was doing fine despite my circumstances.
es_419: … hice todo lo posible para fingir que estaba bien, a pesar de las circunstancias.

source: she's beautiful...
es_419: Es hermosa…

source: until now...
es_419: Hasta ahora…

source: don't jump to conclusions.
es_419: No imagines nada raro.

source: sorry I seem so full of myself.
es_419: Perdón si parezco engreído.

source: oh, dear. a hit and run.
es_419: Ay. Los chocó y se fugó.

source: stop spending 24/7 with your boss and get a change of scenery.
es_419: Deja ya de pasar todo el tiempo con tu jefe y cambia un poco de aire.

source: O-old man?
es_419: ¿U-un viejo?

source: what's taking you so long?
es_419: ¿Por qué tardas tanto?

source: I learned I was mistaken after I received your letter of resignation.
es_419: Comprendí mi error cuando leí tu carta de renuncia.

source: then if you'll excuse--
es_419: Bueno, si me discul…

source: oh, poor dohyeok... it must have been so hard to have a father like me…
es_419: Ay, pobre Dohyeok. Debió ser difícil tener un padre como yo…

source: I'm such a fool.
es_419: Qué tonta soy.

source: I have 1.6 billion won!*
es_419: ¡Tengo 1600 millones de wones!

source: I object.
es_419: Me opongo.

source: oh, no. I should just get her to a hotel nearby.
es_419: Ay, no. Será mejor que la lleve a un hotel por aquí.

source: compared to all the past ones that were a wreck,
es_419: Comparada con los anteriores, que eran un desastre,

source: dumbstruck
es_419: PASMADA

source: timid
es_419: TEMEROSA

source: there's a lot I want to know about you.
es_419: Quiero saber muchas cosas de ti.

source: hah...
es_419: Ja…

source: where's the first-aid kit?
es_419: ¿Dónde está el botiquín?

source: ...when I foolishly asked her to be my friend.
es_419: … cuando, como un tonto, le pedí que fuéramos amigos.

source: achoo!
es_419: ¡Achís!

source: I can't taste any of the food.
es_419: No puedo ni comer esto.

source: I'm looking forward to working with you.
es_419: Anhelo trabajar con usted.

source: ...how does that make me a gold digger?
es_419: … ¿por qué soy yo una cazafortunas?

source: hey, ms. gam!
es_419: ¡Señorita Gam!

source: But how could I possibly--
es_419: ¿Pero cómo podría…?

source: but I'll drink today.
es_419: Pero hoy beberé.

source: no beans.
es_419: Sin guisantes.

source: is it because he has his hair down?
es_419: ¿Será porque se cambió el peinado?

source: I wonder if she's doing all right.
es_419: ¿Le estará yendo bien?

source: spin
es_419: GIRA

source: wow...
es_419: Guau…

source: I'm too grown up to dream of becoming a cinderella.
es_419: Ya estoy grande para soñar con ser Cenicienta.

source: oh, it's nothing...
es_419: Ah, no es nada…

source: hearing that from you...
es_419: Al oírte decir eso…

source: How far did you go with him?
es_419: ¿Qué hiciste con él?

source: hey.
es_419: Oye.

source: barista license academy
es_419: Licencia de barista

source: that makes us even with the tmi.
es_419: Ahora ambos hablamos de más.

source: a strong presence!
es_419: ¡Qué presencia!

source: jeez.
es_419: Uff.

source: I have a housekeeper, so you don't need to clean or anything.
es_419: Tengo ama de llaves, así que no debes limpiar ni nada de eso.

source: he said he'd hand over his position when he finds a good successor.
es_419: Decía que cedería su puesto cuando encontrara a un buen sucesor.

source: o-oh…
es_419: A-ah…

source: grin
es_419: sonrisota

source: how about you take this opportunity to think about what you want to do?
es_419: ¿Por qué no aprovecha la oportunidad y piensa en qué quiere hacer?

source: the ceo of iren, the nation's number one cosmetics company.
es_419: El CEO de IREN, la mejor empresa de cosméticos del país.

source: I heard that was so that it could take place before she left the company.
es_419: Oí que lo movieron para hacerlo antes de que ella se fuera de la empresa.

source: rub
es_419: FRIS

source: who's yu-eun?
es_419: ¿Quién es Yu-eun?

source: I actually feel like I'm finally working now.
es_419: Más bien, siento que al fin estoy trabajando.

source: How cute
es_419: QUÉ TIERNA

source: right?
es_419: ¿Verdad?

source: ...that happens?
es_419: … pasa eso?

source: I-i'll...
es_419: M-me…

source: your resignation.
es_419: Tu renuncia.

source: to...
es_419: A…

source: sit here.
es_419: Siéntate.

source: He's not that old...
es_419: No es tan grande…

source: but it was my first blind date! why did you do that?!
es_419: ¡Pero fue mi primera cita a ciegas! ¡¿Por qué hice eso?!

source: oh, by the way--
es_419: Ah, por cierto…

source: then they'll ask me why…
es_419: Me van a preguntar por qué…

source: I'm the CEO, and she's a mere employee.
es_419: Yo soy el CEO, y ella solo es una empleada.

source: ah! shut up! stop!
es_419: ¡Ah, cállate! ¡Basta!

source: then what's going on with him?
es_419: Entonces, ¿qué hay con él?

source: but be careful not to get caught and act as normal as possible before the final attack.
es_419: Pero ten cuidado, que no te descubra. Haz como si nada hasta el ataque final.

source: milk
es_419: LECHE

source: corporate card
es_419: Tarjeta corporativa

source: I saw some books on raising a child on his desk.
es_419: Vi libros sobre criar niños en su escritorio.

source: why is this coat so big?!
es_419: ¡Este abrigo es inmenso!

source: I actually won the lottery.
es_419: En realidad, gané la lotería.

source: iren‘s new face
es_419: El nuevo rostro de IREN

source: I would've totally agreed a few years back.
es_419: Un par de años atrás, le habría dado la razón.

source: - episode 23 -
es_419: - episodio 23 -

source: that's how incredible you are...
es_419: Así de extraordinaria eres…

source: but I'm already done.
es_419: Pero si ya lo hice.

source: she was an ideal secretary!
es_419: ¡Era la secretaria ideal!

source: take
es_419: TOME

source: ow, my head…
es_419: Ay, mi cabeza…

source: ...but am I pushing myself too hard?
es_419: Pero ¿no me estaré sobreexigiendo?

source: daSH
es_419: FRUM

source: that's not it!
es_419: ¡Nada que ver!

source: were you crying?
es_419: ¿Estabas llorando?

source: oh my. she should know her place.
es_419: Vaya. Qué desubicada.

source: My friends can be weird at times...
es_419: Mis amigas a veces son raras…

source: you eat well.
es_419: Comes bien.

source: even if 10 years go by and I haven't accomplished anything, I won't even be 40 yet.
es_419: Y aunque pasen 10 años y no haya logrado nada, no tendré aún ni 40.

source: ...do this to me!
es_419: … hacer esto!

source: There's no way I could be thinking straight in my current state.
es_419: Es imposible que pueda pensar bien en este estado.

source: I only dropped by to say hi.
es_419: Solo pasé a saludar.

source: I can do it myself!
es_419: ¡Lo haré yo sola!

source: I'm sure there's an album at home.
es_419: Seguro en casa hay un álbum.

source: I'll handle this one.
es_419: Yo me encargo de esto.

source: splash
es_419: chof

source: flip
es_419: FUIP

source: s-sir, I can do it...
es_419: P-puedo sola, señor…

source: I understand,
es_419: Entiendo,

source: and many other reasons…
es_419: Y muchos otros más…

source: rattle
es_419: TRAC

source: oh, and...
es_419: Ah, y…

source: he even reads books to improve himself.
es_419: Hasta lee libros para mejorar.

source: this is bad.
es_419: Esto pinta mal.

source: what's this all about?
es_419: ¿Qué están diciendo?

source: I was going to spend all the time I had for myself...
es_419: Iba a dedicar todo el tiempo a mí misma…

source: empty
es_419: VACÍO

source: w-wait a second.
es_419: U-un momento.

source: BEEP
es_419: BIP

source: did he say yu-eun?
es_419: ¿Acaso dijo Yu-eun?

source: haa…
es_419: Aah…

source: I'm done with the handover and the new comers are doing all the work!
es_419: ¡Ya terminé de delegar y las nuevas están haciendo todo el trabajo!

source: my past…
es_419: Mi pasado…

source: why do you always start with "oh"?
es_419: Por qué siempre dices "ah" primero?

source: my mom was the only one who was on my side…
es_419: Mamá era la única que estaba de mi lado…

source: sip
es_419: GLU

source: I'll rearrange the schedule with the others.
es_419: Le puedo liberar la agenda.

source: exhale
es_419: EXHALA

source: I came to work decked out in designer goods to piss you off.
es_419: Vine al trabajo engalanada con ropa de diseño para hacerlo enojar.

source: quiet…
es_419: Silencio…

source: I'll go and see.
es_419: Iré a ver.

source: how about this, miss?
es_419: ¿Este le gusta, señorita?

source: is it something you Can brush off?
es_419: ¿Es algo que se pueda omitir?

source: you're so funny, ms. gam.
es_419: Eres muy divertida, señorita Gam.

source: Questions without the marking are all worth 2 points.
es_419: Las preguntas sin marca valen 2 puntos.

source: I'm surprised.
es_419: Me asombras.

source: whatever!
es_419: ¡No importa!

source: they're more than just friends.
es_419: No son solo amigos.

source: I'll pay it all at once!
es_419: ¡Lo compro en un pago!

source: …friends.
es_419: … amigos.

source: so about this new project…
es_419: Hablando del proyecto nuevo…

source: …is the third son of the hanyoung conglomerate.
es_419: … es el tercer hijo del conglomerado Hanyoung.

source: and I don't think I will in the future, either.
es_419: Y dudo que la tenga en el futuro.

source: ...finally know her name.
es_419: … te aprendiste su nombre.

source: I guess I’m not going home today.
es_419: Supongo que hoy no iré a casa.

source: chug it!
es_419: ¡Todo!

source: Do not turn over this page until you are instructed to do so.
es_419: No dé vuelta a la página hasta que se lo indiquen.

source: schedule
es_419: ajustado

source: I can't...
es_419: No puedo…

source: please take good care of him.
es_419: Cuídalo mucho, por favor.

source: that's right.
es_419: Así es.

source: she's a secretary that every ceo dreams of.
es_419: ella es el sueño de cualquier CEO.

source: I'm sorry, yu-eun.
es_419: Lo siento, Yu-eun.

source: or expecting a compliment.
es_419: ni esperando elogios.

source: ...my cold-blooded and ruthless boss.
es_419: … mi jefe despiadado e implacable.

source: amount of deposit
es_419: total depositado

source: natural germanium and sulfur
es_419: germanio y sulfuro natural

source: what happened?
es_419: ¿Qué pasó?

source: ...I feel good.
es_419: … me siento bien.

source: I've suffered and endured many hardships, and things are finally looking up.
es_419: Ya sufrí mucho, y superé muchas adversidades, y ahora al fin todo mejoró.

source: food waste -household-
es_419: restos de alimentos -vivienda-

source: hurry up, I'm bored--
es_419: Apúrate, me aburro…

source: what did I do wrong?
es_419: ¿En qué me equivoqué?

source: yeah.
es_419: Sí.

source: yikes!
es_419: ¡Aia!

source: snap out of it, yu-eun!
es_419: ¡Contrólate, Yu-eun!

source: day
es_419: DÍA

source: S
es_419: u

source: oh, no. it's time for his morning meeting.
es_419: Ay, no. Es hora de su reunión matutina.

source: I can do it!
es_419: ¡Lo haré yo!

source: I guess my studies paid off.
es_419: Valió la pena estudiar.

source: I was adopted.
es_419: soy adoptado.

source: is ms. gam immune to my charm?
es_419: ¿La señorita Gam es inmune a mi encanto?

source: but it is a treasure chest full of advice for a leader...
es_419: pero es un tesoro lleno de consejos valiosos para líderes…

source: well, I like your looks.
es_419: Pues, me gusta tu aspecto.

source: then what?
es_419: ¿Y entonces?

source: Okay, I'll apologize and then...
es_419: Bueno, me disculparé y luego…

source: in her point of view.
es_419: Según su punto de vista.

source: But there's no telling what will happen tomorrow.
es_419: Pero es imposible saber qué pasará mañana.

source: /online purchase
es_419: /compra en línea

source: no, sir.
es_419: No, señor.

source: well, well! look who grabbed the bait!
es_419: ¡Vaya, vaya! ¿Quién mordió el anzuelo?

source: There are plenty of people who are better than me out there.
es_419: Hay muchas personas mejores que yo para ti.

source: it's chae...
es_419: Es Chae…

source: become too lax lately?
es_419: relajado demasiado?

source: eating out of anger!
es_419: ¡Come de ira!

source: very well. how nice it is to have a lottery winner as a friend.
es_419: Muy bien. Qué bueno que mi amiga haya ganado la lotería.

source: which department? that person's got guts! lol
es_419: De qué departamento? Qué coraje esa persona! Jaja

source: - episode 10 -
es_419: - episodio 10 -

source: oh my gosh… it's so good!
es_419: Por favor… ¡Está riquísimo!

source: he does care about me...
es_419: Él me quiere mucho…

source: I want to know…
es_419: Quiero saber…

source: And...
es_419: Y…

source: must read in times of crisis
es_419: debe leer en momentos de crisis

source: something urgent really did come up.
es_419: Es verdad que surgió algo urgente.

source: it's been a year since I became dohyeok's personal secretary...
es_419: Hace ya un año que soy la secretaria personal de Dohyeok…

source: I only found out recently that the location of the workshop had changed.
es_419: Me enteré hace poco que habían cambiado la ubicación del taller.

source: yeah, it is.
es_419: Sí, es cierto.

source: oops
es_419: UPS

source: I understand. it’s kind of confusing.
es_419: Entiendo. Puede ser confuso.

source: what if…
es_419: ¿Y si…

source: sir, your monday is fully booked. is it possible to move this meeting?
es_419: Señor, tiene todo el lunes completo. ¿No puede postergar esa reunión?

source: I'm not quite sure why... but now I know I was greatly mistaken.
es_419: No sé bien por qué… pero ahora sé que estaba muy equivocado.

source: but today is the anniversary of my parents' death...
es_419: Pero hoy es el aniversario de la muerte de mis padres…

source: so stuffed
es_419: LLENÍSIMA

source: that's because…
es_419: Es porque…

source: I plan on being more attentive and compliment you more.
es_419: tengo intenciones de ser más atento y elogiarte más.

source: grasp
es_419: aferra

source: whatever. think of your next step for tomorrow, ms. i-hit-the-jackpot.
es_419: No importa. Piensa en lo que harás mañana, señorita "me gané la lotería".

source: let's go!
es_419: ¡Vamos!

source: poof
es_419: PUF

source: at first, I thought...
es_419: Al principio, creí que…

source: ...and I'm starting to think something's wrong.
es_419: … y me parece que le pasa algo.

source: I'm all self-conscious about it now!
es_419: ¡Ahora no puedo evitar pensarlo!

source: rise
es_419: DE PIE

source: is this asking for too much?
es_419: ¿Es demasiado pedir?

source: uh… okay.
es_419: Eh… Bueno.

source: you know, you're so full of yourself.
es_419: Qué engreído, por favor.

source: decently popular
es_419: BIEN RECIBIDA

source: d r i p
es_419: p l i c

source: everyone knows that I studied in the states...
es_419: Todos saben que estudié en Estados Unidos…

source: I'll hold off...
es_419: Voy a esperar…

source: what…
es_419: ¿Qué…?

source: weep
es_419: SNIF

source: I guess I'm not ready to meet someone…
es_419: Creo que no estoy lista para conocer a alguien…

source: uh...
es_419: Eh…

source: I'm just as busy as you are!
es_419: ¡Estoy tan ocupado como tú!

source: then, enjoy your meal.
es_419: Bien, buen provecho.

source: this is for you!
es_419: ¡Esto es para ti!

source: come on.
es_419: Vamos.

source: 200x.02~200 .07
es_419: 02/200x - 07/200

source: oh? then are you making a career change? that's so impressive.
es_419: Ah, ¿no? ¿Vas a cambiar de carrera? Es admirable.

source: but the world I know doesn't reward people for just being nice.
es_419: Pero en mi mundo no hay recompensas solo por ser buena persona.

source: tight
es_419: cronograma

source: come on in. it's a little messy though…
es_419: Pasa. Aunque está un poco desordenado…

source: but I just look like...
es_419: Pero ahora parece que…

source: something is going on between them.
es_419: Hay algo entre ellos.

source: tmi…
es_419: De más…

source: ex-secretary community
es_419: Comunidad de exsecretarios

source: just one more month. you can do it!!!
es_419: Solo un mes más. ¡¡Tú puedes!!

source: it looks like you won't have a problem if you keep your spending where it is.
es_419: Si sigue haciendo gastos como hasta ahora, parece que no tendrá problemas.

source: ...because I don't want to trouble my uncle since he was the one who took care of me.
es_419: … porque no quiero perturbar a mi tío. Él fue quien se ocupó de mí.

source: how much? everything you won from the lottery?!
es_419: ¿Cuánto? ¡¿Todo lo que ganaste en la lotería?!

source: what do I do now?
es_419: ¿Ahora qué hago?

source: pictures…
es_419: Fotos…

source: umm...
es_419: Eeeh…

source: there's no way it's going to happen.
es_419: Es imposible que pase.

source: s i l e n c e
es_419: s i l e n c i o

source: ...almost like he's not giving me work on purpose.
es_419: Casi como si no me estuviera dando trabajo a propósito.

source: but I don't know. he might have a first crush he can't forget…
es_419: Pero no sé. Quizás se enamoró de alguien y aún no la supera…

source: does he not like my blanket?
es_419: ¿No le gusta mi manta?

source: please forget it for now, sir…
es_419: Por ahora no lo piense más, señor…

source: if only it weren't for yesterday!
es_419: ¡Ojalá no hubiera pasado eso ayer!

source: have they decided what they're doing about getting a supplier for the raw materials?
es_419: ¿Ya decidieron qué van a hacer con la búsqueda del nuevo proveedor de materia prima?

source: dohyeok is in his early 30s…
es_419: Dohyeok tiene poco más de 30…

source: hold it, ms. kang.
es_419: Espera, señorita Kang.

source: ...because she's almost always working late.
es_419: … porque se queda hasta tarde casi siempre.

source: weekly schedule
es_419: agenda semanal

source: ...but I won't watch my childhood friend become the heroine in a b-rated k-drama.
es_419: … pero no permitiré que mi amiga de la infancia protagonice una novelucha de cuarta.

source: oh, no.
es_419: Ay, no.

source: am I... lovesick?
es_419: ¿Tengo… mal de amor?

source: ...but I couldn't get a hold of him since that day.
es_419: … pero desde ese día no logro dar con él.

source: I don’t know what you like, so…
es_419: Es que no sé qué te gusta…

source: …is no different from a hit-and-run.
es_419: … es lo mismo que chocar y fugarse.

source: …at jeju island!
es_419: … ¡la isla Jeju!

source: I-I apologize, sir...
es_419: D-disculpe, señor…

source: um...
es_419: Eh…

source: you always had a plan.
es_419: Siempre tenías un plan.

source: ...superb social skills...
es_419: … aptitudes sociales magníficas…

source: what happened?!
es_419: ¡¿Qué pasó?!

source: I know that might not be a lot of money to you!
es_419: ¡Ya lo sé, para ti no debe ser tanto dinero!

source: what? he's not even fazed by it.
es_419: ¿Cómo? Ni reaccionó.

source: uh... mr. chae...
es_419: Eh… Señor Chae…

source: tired
es_419: CANSADA

source: ...I can't quit now!
es_419: ¡No renunciaré ahora!

source: it's an open secret within the company.
es_419: Es un secreto bien sabido en la empresa.

source: refer to episode 17
es_419: Ver episodio 10

source: it's chae not choi.
es_419: Es Chae, no Choi.

source: ...I'm sorry?
es_419: ¿Perdón?

source: I've done this often.
es_419: Lo he hecho muchas veces.

source: When did that happen?
es_419: ¿Cuándo pasó?

source: y-you are?
es_419: Ah, ¿s-sí?

source: maybe that's why I feel strange.
es_419: Quizás por eso se siente raro.

source: wag
es_419: MUEVE

source: I feel bad she's always working late because of her weird boss.
es_419: Me hace sentir mal que trabaje tanto porque tiene un jefe raro.

source: I was a fool…
es_419: Qué tonta fui…

source: would you like to pay in monthly installments?
es_419: ¿Quiere hacer el pago en cuotas?

source: despair
es_419: DESESPERADA

source: that's bad for her health.
es_419: No es bueno para la salud.

source: inhale
es_419: INHALA

source: now that you think nothing's working...
es_419: Ahora que piensas que nada te funciona…

source: you picked out the peas.
es_419: Separaste los guisantes.

source: careful!
es_419: ¡Cuidado!

source: it was extremely hard to work with you.
es_419: Era muy muy difícil trabajar con usted.

source: stoop
es_419: CABECEA

source: ham * sausage
es_419: JAMÓN * SALCHICHAS

source: it's strange...
es_419: Qué raro…

source: I can't believe I'm having wild fantasies about a billionaire...
es_419: No puedo creer que tenga fantasías locas con un multimillonario…

source: glimpse
es_419: MIRA

source: rummage
es_419: BUSCA

source: but, I was just--
es_419: Pero yo…

source: not like this though…
es_419: Aunque no así…

source: come on,
es_419: Vamos,

source: is that your usual bed time?
es_419: ¿Siempre te acuestas a esa hora?

source: are working late into the night...
es_419: están trabajando hasta tarde…

source: rush
es_419: apurada

source: my bad, ms. gam.
es_419: Mi culpa, señorita Gam.

source: ...there's still a lot of time left before dohyeok arrives.
es_419: Aún falta mucho para que llegue Dohyeok.

source: plus, it's not like I'm going to disappear.
es_419: Además, no es que yo vaya a desaparecer.

source: call me yu-eun from now on.
es_419: Dime Yu-eun desde ahora.

source: wHat time did yOu sLeEp?
es_419: ¿A qué hora te acostaste?

source: yes, it's a trench coat for men.
es_419: Sí, es una gabardina de hombre.

source: let's say my life turns into a real life k-drama...
es_419: Digamos que mi vida se transforma en una novela…

source: even if I blow a year trying something new, I'll only be 29 next year.
es_419: Aunque pierda un año probando algo nuevo, el próximo año tendré 29.

source: get
es_419: VETE

source: twirl
es_419: FRIU

source: if I cook at home...
es_419: Si cocino en casa…

source: - episode 29 -
es_419: - episodio 29 -

source: ...that my wealth and status is just temporary.
es_419: … mi riqueza y mi posición son pasajeras.

source: shout
es_419: GRITA

source: Original work by Parand
es_419: Obra original de Parand

source: I should tell jiwoo that I messed it up.
es_419: Mejor le digo a Jiwoo que la arruiné.

source: 30% discount!
es_419: ¡30 % de descuento!

source: You know, his secretary?
es_419: ¿Conoces a la secretaria?

source: ...why does he look so indifferent???
es_419: … ¿¿por qué está tan indiferente??

source: ...somehow...
es_419: … no sé por qué…

source: ...what do you want?
es_419: … ¿qué quieres?

source: ...what if you get worse?
es_419: … ¿y si se pone peor?

source: that…
es_419: Eso…

source: I'll get it!
es_419: ¡Yo atiendo!

source: I'm...
es_419: Al fin…

source: I need to submit the expense report!
es_419: ¡Tengo que entregar el informe de gastos!

source: I like feeding my friends and cats, and my hobbies are listening to K-pop and horror podcasts.
es_419: Me gusta alimentar a mis amistades y a mis gatos. En mi tiempo libre escucho K-pop y pódcast de terror.

source: I need to get to work.
es_419: Debo ir a trabajar.

source: then you did all that for the first time?!
es_419: ¡¿Entonces todo eso fue tu primera vez?!

source: oh! i-it's just that it's a bit sudden!
es_419: ¡Ah! ¡E-es que es medio repentino!

source: now I just want to…
es_419: Ahora solo quiero…

source: education
es_419: Educación

source: crumple
es_419: arruga

source: - episode 08 -
es_419: - episodio 08 -

source: ...we had met each other sooner?
es_419: … nos hubiésemos conocido antes?

source: it's harassment.
es_419: será acoso.

source: Like you said, I've got enough time and money.
es_419: Tú lo dijiste: ahora tengo mucho tiempo y dinero.

source: activities and social experience
es_419: Actividades y experiencia social
